def raspisanie(a):
    ytochnenie = input('По какому занятию Вам скинуть расписание?')
    if 'Пит' in ytochnenie:
            print('Понедельник - 18:00, Вторник - Олег Юрьевич отдыхает, Среда- Олег Юрьевич идет за семечками в КБ, с Четверга по воскресенье Олег Юрьевич играет в кс')
    elif 'Самб' in ytochnenie:
        print("Понедельник - Олег Юрьевич занят питоном, Вторник - Олег Юрьевич спит, Среда - так уж и быть придет не знаю когда, с Четверга по пятницу - Олег Юрьевич на совещании")
def kontakti(b):
    ytochnenie2 = input('Какой тренер Вас интересует?')
    if 'Оле' in ytochnenie2:
        print('Номер Олега Юрьевича - кто знает, тот знает')
    elif 'Дан' in ytochnenie2:
        print('Даниил Алексеевич - в КБ с Олегом Юрьевичом, не беспокоить')
def oplata(c):
    ytochnenie3 = input('По какому занятию Вам определить сумму?')
    if 'Самб' in ytochnenie3:
        print('За самбо - 1000р/сек')
    elif 'Пит' in ytochnenie3:
        print('За питон - семечками(Джин)')
def chtonado(d):
    ytochnenie4 = input('По какому занятию?')
    if 'Самб' in ytochnenie4:
        print('Вам надо взять с собой Олега Юрьевича и семечки')
    elif 'Пит' in ytochnenie4:
        print('2 пачки семечек, главное без алкоголя, и еще, пожалуйста, возьмите с собой жижу')
def transfer(e):
    ytochnenie5 = input('По какому занятию Вам нужен трансфер?')
    if 'Самб' in ytochnenie5:
        print('Олег Юрьевчи Вас не подкинет')
    elif 'Пит' in ytochnenie5:
        print('Олег Юрьевич Вас сам заберет и увезет в лес на поле подсолнухов собирть семечки, потому что в КБ закончились все семечки')

